In [3]:
import pandas as pd

data1 = [1,2,3,4]
data2 =[
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
data3={
    "populasi" :[10,20,30,40],
    "surface":[90,80,70,60],
    "hdi" : [11,22,33,44]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)
print(df1)
print(df2)
print(df3)

   0
0  1
1  2
2  3
3  4
   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   populasi  surface  hdi
0        10       90   11
1        20       80   22
2        30       70   33
3        40       60   44

In [8]:
df3.index

Index(['satu', 'dua', 'tiga', 'empat'], dtype='object')

In [6]:
df3.index = ["satu","dua","tiga","empat"]
df3

       populasi  surface  hdi
satu         10       90   11
dua          20       80   22
tiga         30       70   33
empat        40       60   44

In [9]:
df3.columns

Index(['populasi', 'surface', 'hdi'], dtype='object')

In [10]:
df3.loc["satu" : "tiga", "populasi": "surface"]

      populasi  surface
satu        10       90
dua         20       80
tiga        30       70

In [12]:
df3.iloc[0:3,0:2]

      populasi  surface
satu        10       90
dua         20       80
tiga        30       70

In [13]:
df3[["populasi","surface"]]

       populasi  surface
satu         10       90
dua          20       80
tiga         30       70
empat        40       60

In [16]:
data = {
    "Athlete" :["Michael Phelps","Michael Phelps","Michael Phelps","Natalie Coughlin","Aleksey Nemov"],
    "Age": [23,19,27,25,24],
    "Country" : ["united States", "Canada", "United States", "Norway", "China"],
    "Year" : [2008, 2004, 2012, 2008, 2000],
    "Gold Medals":[8,6,4,1,2]
}

df1= pd.DataFrame(data)
df1

            Athlete  Age        Country  Year  Gold Medals
0    Michael Phelps   23  united States  2008            8
1    Michael Phelps   19         Canada  2004            6
2    Michael Phelps   27  United States  2012            4
3  Natalie Coughlin   25         Norway  2008            1
4     Aleksey Nemov   24          China  2000            2

In [17]:
df1.columns

Index(['Athlete', 'Age', 'Country', 'Year', 'Gold Medals'], dtype='object')

In [19]:
df1[["Athlete", "Country","Year"]]

            Athlete        Country  Year
0    Michael Phelps  united States  2008
1    Michael Phelps         Canada  2004
2    Michael Phelps  United States  2012
3  Natalie Coughlin         Norway  2008
4     Aleksey Nemov          China  2000

In [22]:
df1.iloc[0:3,0:]

          Athlete  Age        Country  Year  Gold Medals
0  Michael Phelps   23  united States  2008            8
1  Michael Phelps   19         Canada  2004            6
2  Michael Phelps   27  United States  2012            4

In [ ]:
print("hello world")